{
  "abdominal_pain": "Aching or discomfort in the stomach or lower belly area. abdominal pain",
  "abnormal_menstruation": "Irregular or unusual periods, such as heavy flow or missed cycles. abnormal menstruation",
  "acidity": "Burning feeling in the chest or throat due to excess stomach acid. acidity",
  "acute_liver_failure": "Sudden loss of liver function causing serious illness. acute liver failure",
  "altered_sensorium": "Confused thinking or reduced awareness of surroundings. altered sensorium",
  "anxiety": "Constant worry, nervousness, or fear that affects daily life. anxiety",
  "back_pain": "Discomfort or ache felt in the lower or upper back. back pain",
  "belly_pain": "Pain or cramps in the abdominal or stomach region. belly pain",
  "blackheads": "Small dark bumps on the skin due to clogged hair follicles. blackheads",
  "bladder_discomfort": "Pain, pressure, or burning feeling in the bladder area. bladder discomfort",
  "blister": "A fluid-filled bubble on the skin caused by friction or heat. blister",
  "blood_in_sputum": "Coughing up mucus that has traces of blood in it. blood in sputum",
  "bloody_stool": "Bowel movements that contain visible blood. bloody stool",
  "blurred_and_distorted_vision": "Inability to see clearly or sharp images. blurred and distorted vision",
  "breathlessness": "Difficulty in breathing or feeling short of breath. breathlessness",
  "brittle_nails": "Nails that break, split, or chip easily. brittle nails",
  "bruising": "Discolored skin caused by bleeding under the surface. bruising",
  "burning_micturition": "Burning or stinging pain while urinating. burning micturition",
  "chest_pain": "Discomfort or tightness felt in the chest area. chest pain",
  "chills": "Shivering or feeling cold even when the environment isn't. chills",
  "cold_hands_and_feets": "Hands or feet that feel unusually cold. cold hands and feets",
  "coma": "A state of deep unconsciousness from which a person can't be awakened. coma",
  "congestion": "Blocked nose or chest due to mucus buildup. congestion",
  "constipation": "Difficulty or infrequent bowel movements. constipation",
  "continuous_feel_of_urine": "Constant sensation of needing to urinate even after emptying the bladder. continuous feel of urine",
  "continuous_sneezing": "Repeated sneezing that doesn't stop, often due to allergies or irritation. continuous sneezing",
  "cough": "Forceful expulsion of air from the lungs, often to clear mucus or irritants. cough",
  "cramps": "Sudden, painful muscle contractions that cause temporary discomfort. cramps",
  "dark_urine": "Urine that appears darker than usual, ranging from amber to brown color. dark urine",
  "dehydration": "Body's lack of sufficient water, causing thirst, dry mouth, and weakness. dehydration",
  "depression": "Persistent feelings of sadness, hopelessness, and loss of interest in activities. depression",
  "diarrhoea": "Frequent, loose, or watery bowel movements. diarrhoea",
  "dischromic_patches": "Areas of skin that are lighter or darker than the surrounding skin. dischromic patches",
  "distention_of_abdomen": "Swollen or bloated belly that feels tight and uncomfortable. distention of abdomen",
  "dizziness": "Feeling lightheaded, unsteady, or like the room is spinning. dizziness",
  "drying_and_tingling_lips": "Lips that feel dry, cracked, and have a prickling sensation. drying and tingling lips",
  "enlarged_thyroid": "Swelling in the neck area due to an enlarged thyroid gland. enlarged thyroid",
  "excessive_hunger": "Feeling unusually hungry or needing to eat more than normal. excessive hunger",
  "extra_marital_contacts": "Sexual relationships outside of marriage that may increase infection risk. extra marital contacts",
  "family_history": "Medical conditions that run in the family and may increase personal risk. family history",
  "fast_heart_rate": "Heart beating faster than normal, often felt as pounding in the chest. fast heart rate",
  "fatigue": "Extreme tiredness or exhaustion that doesn't improve with rest. fatigue",
  "fluid_overload": "Too much fluid in the body causing swelling and breathing difficulties. fluid overload",
  "foul_smell_of_urine": "Urine that has a strong, unpleasant, or unusual odor. foul smell of urine",
  "headache": "Pain or aching sensation in the head or upper neck area. headache",
  "high_fever": "Body temperature significantly above normal, usually over 101Â°F (38.3Â°C). high fever",
  "hip_joint_pain": "Discomfort or aching in the hip area where the leg meets the pelvis. hip joint pain",
  "history_of_alcohol_consumption": "Past or current regular drinking of alcoholic beverages. history of alcohol consumption",
  "increased_appetite": "Feeling hungrier than usual or eating more food than normal. increased appetite",
  "indigestion": "Discomfort in the upper belly after eating, often with bloating or nausea. indigestion",
  "inflammatory_nails": "Nails that are red, swollen, or painful around the edges. inflammatory nails",
  "internal_itching": "Itchy sensation felt inside the body, often in the throat or ears. internal itching",
  "irregular_sugar_level": "Blood sugar that is too high or too low compared to normal ranges. irregular sugar level",
  "irritability": "Feeling easily annoyed, frustrated, or quick to anger. irritability",
  "irritation_in_anus": "Discomfort, burning, or itching around the anal opening. irritation in anus",
  "itching": "Uncomfortable sensation that creates the urge to scratch the skin. itching",
  "joint_pain": "Aching or discomfort in the areas where bones meet and move. joint pain",
  "knee_pain": "Discomfort or aching in the knee joint area. knee pain",
  "lack_of_concentration": "Difficulty focusing attention or staying mentally alert. lack of concentration",
  "lethargy": "Feeling sluggish, tired, and lacking energy or motivation. lethargy",
  "loss_of_appetite": "Reduced desire to eat or feeling full quickly when eating. loss of appetite",
  "loss_of_balance": "Difficulty maintaining steady posture or coordination while moving. loss of balance",
  "loss_of_smell": "Inability to detect odors or reduced sense of smell. loss of smell",
  "malaise": "General feeling of discomfort, illness, or being unwell. malaise",
  "mild_fever": "Slightly elevated body temperature, usually between 99-101Â°F (37.2-38.3Â°C). mild fever",
  "mood_swings": "Rapid changes in emotional state from happy to sad or angry. mood swings",
  "movement_stiffness": "Difficulty moving joints or muscles smoothly, feeling rigid or tight. movement stiffness",
  "mucoid_sputum": "Thick, sticky mucus coughed up from the lungs or throat. mucoid sputum",
  "muscle_pain": "Aching or soreness in the muscles of the body. muscle pain",
  "muscle_wasting": "Loss of muscle mass and strength, making muscles appear smaller. muscle wasting",
  "muscle_weakness": "Reduced strength or power in the muscles. muscle weakness",
  "nausea": "Feeling sick to the stomach with an urge to vomit. nausea",
  "neck_pain": "Discomfort or stiffness in the neck area. neck pain",
  "nodal_skin_eruptions": "Small bumps or lumps that appear on the skin. nodal skin eruptions",
  "obesity": "Being significantly overweight with excess body fat. obesity",
  "pain_behind_the_eyes": "Aching or pressure felt behind or around the eye area. pain behind the eyes",
  "pain_during_bowel_movements": "Discomfort or sharp pain when having a bowel movement. pain during bowel movements",
  "pain_in_anal_region": "Discomfort or aching around the anal opening. pain in anal region",
  "painful_walking": "Discomfort or pain when moving on foot. painful walking",
  "palpitations": "Feeling of rapid, strong, or irregular heartbeats. palpitations",
  "passage_of_gases": "Releasing gas from the intestines through the rectum. passage of gases",
  "patches_in_throat": "Visible spots or discolored areas inside the throat. patches in throat",
  "phlegm": "Thick mucus produced in the respiratory tract, often coughed up. phlegm",
  "polyuria": "Producing abnormally large amounts of urine. polyuria",
  "prominent_veins_on_calf": "Clearly visible, enlarged veins on the lower leg. prominent veins on calf",
  "puffy_face_and_eyes": "Swollen or bloated appearance of the face and eye area. puffy face and eyes",
  "pus_filled_pimples": "Inflamed bumps on the skin containing white or yellow fluid. pus filled pimples",
  "receiving_blood_transfusion": "Having blood from another person transferred into your bloodstream. receiving blood transfusion",
  "receiving_unsterile_injections": "Getting shots with contaminated or dirty needles. receiving unsterile injections",
  "red_sore_around_nose": "Painful, inflamed area of skin near the nose. red sore around nose",
  "red_spots_over_body": "Small red marks or dots appearing on the skin. red spots over body",
  "redness_of_eyes": "Eyes that appear pink, red, or bloodshot. redness of eyes",
  "restlessness": "Feeling unable to relax, sit still, or stay calm. restlessness",
  "runny_nose": "Excess mucus flowing from the nose. runny nose",
  "rusty_sputum": "Mucus coughed up that has a reddish-brown color. rusty sputum",
  "scurring": "Flaking or peeling of the skin in small pieces. scurring",
  "shivering": "Uncontrollable shaking of the body, often due to cold or fever. shivering",
  "silver_like_dusting": "Fine, silvery scales or flakes appearing on the skin. silver like dusting",
  "sinus_pressure": "Feeling of fullness, pressure, or pain in the face and forehead. sinus pressure",
  "skin_peeling": "Outer layer of skin coming off in flakes or sheets. skin peeling",
  "skin_rash": "Red, irritated, or bumpy patches on the skin. skin rash",
  "slurred_speech": "Difficulty speaking clearly, with words sounding unclear or mumbled. slurred speech",
  "small_dents_in_nails": "Tiny pits or indentations on the surface of fingernails or toenails. small dents in nails",
  "spinning_movements": "Feeling like you or your surroundings are rotating or whirling. spinning movements",
  "spotting_urination": "Small amounts of urine leaking or dribbling out. spotting urination",
  "stiff_neck": "Difficulty moving the neck due to pain or muscle tightness. stiff neck",
  "stomach_bleeding": "Internal bleeding in the stomach causing blood in vomit or stool. stomach bleeding",
  "stomach_pain": "Aching or cramping in the abdominal or belly area. stomach pain",
  "sunken_eyes": "Eyes that appear deeper set or hollow in the face. sunken eyes",
  "sweating": "Producing moisture on the skin, often due to heat, exercise, or illness. sweating",
  "swelled_lymph_nodes": "Enlarged, tender lumps under the skin, often in the neck or armpits. swelled lymph nodes",
  "swelling_joints": "Joints that appear larger, puffy, or inflamed. swelling joints",
  "swelling_of_stomach": "Belly that appears larger or more distended than normal. swelling of stomach",
  "swollen_blood_vessels": "Enlarged veins or arteries that are visible under the skin. swollen blood vessels",
  "swollen_extremeties": "Arms, legs, hands, or feet that appear larger due to fluid buildup. swollen extremeties",
  "swollen_legs": "Legs that appear larger or puffy due to fluid retention. swollen legs",
  "throat_irritation": "Scratchy, sore, or uncomfortable feeling in the throat. throat irritation",
  "toxic_look_(typhos)": "Severely ill appearance with confusion and high fever. toxic look (typhos)",
  "ulcers_on_tongue": "Painful sores or open wounds on the tongue. ulcers on tongue",
  "unsteadiness": "Feeling wobbly or having trouble maintaining balance. unsteadiness",
  "visual_disturbances": "Changes in eyesight such as blurriness, spots, or flashing lights. visual disturbances",
  "vomiting": "Forcefully bringing up stomach contents through the mouth. vomiting",
  "watering_from_eyes": "Excess tears flowing from the eyes. watering from eyes",
  "weakness_in_limbs": "Reduced strength or power in the arms or legs. weakness in limbs",
  "weakness_of_one_body_side": "Loss of strength affecting only the left or right side of the body. weakness of one body side",
  "weight_gain": "Increase in body weight over time. weight gain",
  "weight_loss": "Decrease in body weight over time. weight loss",
  "yellow_crust_ooze": "Thick, yellowish discharge that dries and forms a crusty layer. yellow crust ooze",
  "yellow_urine": "Urine that appears more yellow than usual, often indicating dehydration. yellow urine",
  "yellowing_of_eyes": "The white part of the eyes taking on a yellow color. yellowing of eyes",
  "yellowish_skin": "Skin that takes on a yellow tint, often indicating liver problems. yellowish skin"
}